/*1. Завдання "Порівняння чисел":
Створіть змінні a та b, та присвойте їм значення чисел. Порівняйте значення змінних за допомогою операторів порівняння (<, >, <=, >=). Виведіть результати порівняння у консоль.
let a = 10, b = 5;
alert( a < b );
alert( a > b );
alert( a <= b );
alert( a >= b );
*/
//2. Завдання "Порівняння рядків":Створіть змінні string1 та string2, та присвойте їм значення рядків. Порівняйте значення змінних за допомогою операторів порівняння (<, >, <=, >=). Виведіть результати порівняння у консоль.
/*
let x = "string1", y = "string2";
alert( x < y );
alert( x > y );
alert( x <= y );
alert( x >= y );
*/
//3. Завдання "Порівняння булевих значень":Створіть змінні bool1 та bool2, та присвойте їм значення true та false. Порівняйте значення змінних за допомогою операторів порівняння (<, >, <=, >=). Виведіть результати порівняння у консоль.
/*
let bool1 = true;
let bool2 = false;
alert( bool1 < bool2 );
alert( bool1 > bool2 );
alert( bool1 <= bool2 );
alert( bool1 >= bool2 );
*/
//4. Завдання "Порівняння різних типів":Створіть змінну num та присвойте їй значення числа. Створіть змінну str та присвойте їй значення рядка, що містить це число. Порівняйте значення змінних за допомогою операторів порівняння (==, !=, ===, !==). Виведіть результати порівняння у консоль.
/*
let num = 10;
let str = "10";
alert( num == str );
alert( num != str );
alert( num === str );
alert( num !== str );
*/
//5. Завдання "Порівняння null та undefined": Створіть змінні nullVar та undefinedVar, та присвойте їм значення null та undefined. Порівняйте значення змінних за допомогою операторів порівняння (==, !=, ===, !==). Виведіть результати порівняння у консоль.
/*
let nullVar = null;
let undefinedVar = undefined;
alert( nullVar == undefinedVar );
alert( nullVar != undefinedVar );
alert( nullVar === undefinedVar );
alert( nullVar !== undefinedVar );
*/
//6. Завдання "Порівняння з NaN":Створіть змінну nanVar та присвойте їй значення NaN. Порівняйте значення змінної з самою собою за допомогою операторів порівняння (==, !=, ===, !==). Виведіть результати порівняння у консоль
/*
let nanVar = NaN;
alert( nanVar == NaN );
alert( nanVar != NaN );
alert( nanVar === NaN );
alert( nanVar !== NaN );
*/
//7. Завдання "Порівняння з NaN":Створіть змінну num та присвойте їй значення числа. Порівняйте цю змінну зі значенням NaN за допомогою операторів порівняння (==, !=, ===, !==). Виведіть результати порівняння у консоль.
/*
let num = NaN;
alert( num == NaN );
alert( num != NaN );
alert( num === NaN );
alert( num !== NaN );
*/
//8. Завдання "Порівняння з null та undefined":Створіть змінні x та y, та присвойте їм значення null та undefined. Порівняйте ці змінні за допомогою операторів порівняння (==, !=, ===, !==). Виведіть результати порівняння у консоль.
/*
let x = null; 
let y = undefined;
alert( x == y );
alert( x != y );
alert( x === y );
alert( x !== y );
*/
//9. Завдання "Порівняння значень різних типів":Створіть змінні num та str, та присвойте їм значення числа та строки відповідно. Порівняйте ці змінні за допомогою операторів порівняння (==, !=, ===, !==). Виведіть результати порівняння у консоль.
let num = Infinity; 
let str = "page";
alert( num == str );
alert( num != str );
alert( num === str );
alert( num !== str );
